In [5]:
import pandas as pd

In [6]:
df = pd.DataFrame(index=['A','B','C','D','E'])

In [12]:
df['col1'] = [1,2,3,4,0]
df['col2'] = [10,20,30,40,25]
df

   col1  col2
A     1    10
B     2    20
C     3    30
D     4    40
E     0    25

# Update all the member of a DataFrame

In [8]:
df = df.apply(lambda x : x + 3)

In [9]:
df

   col1  col2
A     4    13
B     5    23
C     6    33
D     7    43
E     3    28

# Update all the member of a specific row using axis = 1

In [13]:
df

   col1  col2
A     1    10
B     2    20
C     3    30
D     4    40
E     0    25

In [14]:
df = df.apply(lambda x:x+5 if x.name in ['B'] else x, axis=1)
df

   col1  col2
A     1    10
B     7    25
C     3    30
D     4    40
E     0    25

# Update all the member of a specific column using axis = 0

In [15]:
df

   col1  col2
A     1    10
B     7    25
C     3    30
D     4    40
E     0    25

In [16]:
df = df.apply(lambda x : x +20 if x.name in ['col1'] else x, axis=0)
df

   col1  col2
A    21    10
B    27    25
C    23    30
D    24    40
E    20    25